
export interface CityInter {
    [cityName: string]: string[]
  }


export const cities: CityInter = {
    "基隆市": ["中正區", "信義區", "仁愛區", "中山區", "安樂區", "暖暖區", "七堵區"],
    "台北市": ["中正區", "大同區", "中山區", "松山區", "大安區", "萬華區", "信義區", "士林區", "北投區", "內湖區", "南港區", "文山區"], 
    "新北市": ["板橋區", "三重區", "中和區", "永和區", "新莊區", "新店區", "樹林區", "鶯歌區", "三峽區", "淡水區", "汐止區", "瑞芳區", "土城區", "蘆洲區", "五股區", "泰山區", "林口區", "深坑區", "石碇區", "坪林區", "三芝區", "石門區", "八里區", "平溪區", "雙溪區", "貢寮區", "金山區", "萬里區", "烏來區"],
    "宜蘭縣": ["宜蘭市", "頭城鎮", "礁溪鄉", "壯圍鄉", "員山鄉", "羅東鎮", "三星鄉", "大同鄉", "五結鄉", "冬山鄉", "蘇澳鎮", "南澳鄉", "金岳鄉", "大里鄉", "惠來鄉"],
    "桃園市": ["中壢區", "平鎮區", "龍潭區", "楊梅區", "新屋區", "觀音區", "桃園區", "龜山區", "八德區", "大溪區", "復興區", "大園區", "蘆竹區"],
    "新竹市": ["東區", "西區", "北區", "香山區"],
    "新竹縣": ["竹北市", "竹東鎮", "新埔鎮", "關西鎮", "芎林鄉", "橫山鄉", "東河鄉", "建功鄉", "寶山鄉", "峨眉鄉", "湖口鄉", "新豐鄉", "尖石鄉", "北埔鄉", "五峰鄉"],
    "苗栗縣": ["苗栗市", "竹南鎮", "頭份市", "三灣鄉", "南庄鄉", "獅潭鄉", "後龍鎮", "通霄鎮", "苑裡鎮", "大湖鄉", "泰安鄉", "銅鑼鄉", "三義鄉", "西湖鄉", "卓蘭鎮"],
    "台中市": ["中區", "東區", "南區", "西區", "北區", "西屯區", "南屯區", "北屯區", "太平區", "大里區", "霧峰區", "烏日區", "豐原區", "大甲區", "清水區", "沙鹿區", "梧棲區", "大肚區", "龍井區", "霧峰區", "和平區"],
    "南投縣": ["南投市", "埔里鎮", "草屯鎮", "竹山鎮", "集集鎮", "名間鄉", "鹿谷鄉", "中寮鄉", "魚池鄉", "信義鄉", "仁愛鄉"],
    "彰化縣": ["彰化市", "芬園鄉", "花壇鄉", "秀水鄉", "鹿港鎮", "福興鄉", "線西鄉", "和美鎮", "伸港鄉", "員林市", "社頭鄉", "永靖鄉", "埔心鄉", "埔鹽鄉", "大村鄉", "柳川鄉", "三重鎮", "田尾鄉", "北斗鎮", "二林鎮", "田中鎮", "大肚區", "王功鄉", "後壁鄉"],
    "雲林縣": ["斗南鎮", "大埤鄉", "虎尾鎮", "土庫鎮", "褒忠鄉", "東勢鄉", "台西鄉", "澎湖鄉", "四湖鄉", "口湖鄉", "水林鄉", "麥寮鄉", "大林鎮", "民雄鄉", "溪口鄉", "新港鄉", "崙背鄉", "二崙鄉", "古坑鄉", "莿桐鄉", "林內鄉", "竹崎鄉", "大埔鄉", "梅山鄉", "西螺鎮", "北港鎮"],
    "台南市": ["中西區", "東區", "南區", "北區", "安平區", "安南區", "永康區", "歸仁區", "新化區", "左鎮區", "玉井區", "楠西區", "南化區", "仁德區", "關廟區", "龍崎區", "官田區", "麻豆區", "佳里區", "西港區", "七股區", "將軍區", "學甲區", "北門區", "新營區", "後壁區", "白河區", "東山區", "六甲區", "下營區", "鹽水區", "善化區", "大內區", "山上區", "新市區", "安定區"],
    "嘉義市": ["東區", "西區"],
    "嘉義縣": ["太保市", "朴子市", "布袋鎮", "大林鎮", "民雄鄉", "溪口鄉", "新港鄉", "義竹鄉", "鹿草鄉", "中埔鄉", "竹崎鄉", "梅山鄉", "番路鄉", "大埔鄉", "阿里山鄉"],
    "高雄市": ["鹽埕區", "鼓山區", "旗津區", "前鎮區", "三民區", "楠梓區", "小港區", "左營區", "大社區", "岡山區", "路竹區", "阿蓮區", "田寮區", "燕巢區", "橋頭區", "梓官區", "彌陀區", "永安區", "湖內區", "鳳山區", "大寮區", "林園區", "茄萣區", "東沙群島", "南沙群島"],
    "屏東縣": ["屏東市", "潮州鎮", "東港鎮", "恆春鎮", "萬丹鄉", "長治鄉", "麟洛鄉", "九如鄉", "里港鄉", "鹽埔鄉", "高樹鄉", "麻豆鄉", "萬巒鄉", "内埔鄉", "竹田鄉", "新埤鄉", "枋寮鄉", "長治鄉", "南州鄉", "屏東縣", "三地門", "霧台", "瑪家", "泰武", "來義"],
    "花蓮縣": ["花蓮市", "吉安鄉", "秀林鄉", "南區", "鳳林鎮", "卓溪鄉", "萬榮鄉", "玉里鎮", "富里鄉", "光復鄉", "新城鄉"],
    "台東縣": ["台東市", "成功鎮", "關山鎮", "卑南鄉", "大武鄉", "海端鄉", "池上鄉", "綠島", "蘭嶼", "長濱鄉"],
    "澎湖縣": ["馬公市", "湖西鄉", "白沙鄉", "西嶼鄉", "望安鄉", "六腳鄉", "南海", "金龜頭", "小金門"],
    "連江縣(馬祖)": ["南竿", "北竿", "莒光", "東引"],
    "金門縣": ["金城鎮", "金湖鎮", "金寧鄉", "烈嶼鄉", "烏坵鄉"],
    "小琉球": ["小琉球鄉"]
}